#include <iostream>

using namespace std;

 // Завдання 1 //

int main ()
{ 
   int myAge = 28;
   int yourAge = 32;

   if (myAge > yourAge)
  {
    myAge = yourAge;
  }
else
{
   yourAge = myAge;
}
cout << " My age = " << myAge << endl;
cout << " Your age = " << yourAge << endl;

return 0;
   
} 

// Завдання 2 //

int main()
{

int a, b, c;
cout << "Please enter three numbers) \n";

cout << "a: ";
cin >> a;

cout << "\nb: ";
cin >> b;

cout << "\nc: ";
cin >> c;

if (c = (a - b)) 
   cout << "\na: ";
   cout << a;
   cout << " minus b: ";
   cout << b;
   cout << " equals c: ";
   cout << c << endl;

}

else

   cout << "a - b does not equal c: " << endl;
   
return 0;
} 

/* Тут присвоєння замість порівняння, с присвоює результат а - b
тому умова завжди буде true, якщо a-b не дорівнює 0.  Яке б ціле число ми не ввели для с, результат буде перезаписан та нам буде видаваться результат віднімання а та b.
при a - b = 0, компілятор буде виводити результат, який вказан в умові else. */


// Завдання 3 //

/* Якщо запустити попередню програму та ввести значення a=20, b=10, c=50,
то нам видасть результат  a: 20 minus b: 10 equals c: 10, тому що програма проігнорувала 
умову else та перезаписала значення с, і порахувала як 20-10=10, тож с = 10. */

// Завдання 4 //

int main()

{
   int a = 1, b = 1, c;

	if (c = (a - b)) // можна додати дужки і копілято не буде видавати попередження: ((c = (a - b)))
  

    	cout << "The value of c is: " << c;

	return 0;

}
/* Тож с не ініціализоване в 77 строці, але в if присвоюється значення a - b. Відбувається присвоєння с = 0 і умова if не виконується бо с=0 false, в нас немає else
тож програма просто завершується.
*/

// Завдання 5 //
 /* Програма видала попередження з приводу присвоєння с, тому що тут присвоєння =, а не порівняння == і не додані ще одні дужки ()
Ще в результаті було нічого так як: в нас є присвоєння с, с завжди буде = 0, це буде завжди false, програма завершується бо в нас немає else. */